Revit 2026 API

# UIDocumentShowElements(ElementId) Method

---

Shows the element by zoom to fit.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowElements(
	ElementId elementId
)
```
```vb
Public Sub ShowElements (
	elementId As ElementId
)
```
```cpp
public:
void ShowElements(
	ElementId^ elementId
)
```
```fsharp
member ShowElements :
        elementId : ElementId -> unit
```

#### Parameters

elementId ElementId
    Element id that will be shown.

| Exception | Condition |
| --- | --- |
| ArgumentException | Element id is not valid. |

Places the element in the center of screen by moving the view.

#### Reference

UIDocument Class

ShowElements Overload

Autodesk.Revit.UI Namespace